export interface Poem {
  poetry: string;
  author: string;
}

export const poems: Poem[] = [
  {
    "poetry": "去年今日此門中，人面桃花相映紅。<br>人面不知何處去，桃花依舊笑春風。",
    "author": "唐·崔護《題都城南莊》"
  },
  {
    "poetry": "眾芳搖落獨暄妍，佔盡風情向小園。 <br>疏影橫斜水清淺，暗香浮動月黃昏。",
    "author": "宋·林逋《山園小梅》"
  },
  {
    "poetry": "試問閒愁都幾許？ <br>一川煙草，滿城風絮，梅子黃時雨。",
    "author": "宋·賀鑄《青玉案》"
  },
  {
    "poetry": "君問歸期未有期，巴山夜雨漲秋池。 <br>何當共剪西窗燭，卻話巴山夜雨時。",
    "author": "唐·李商隱《青玉案》"
  },
  {
    "poetry": "西風吹老洞庭波，一夜湘君白髮多。 <br>醉後不知天在水，滿船清夢壓星河。",
    "author": "元·唐珙《題龍陽縣青草湖》"
  },
  {
    "poetry": "衣上征塵雜酒痕，遠遊無處不消魂。 <br>此身合是詩人未？細雨騎驢入劍門。",
    "author": "宋·陸游《劍門道中遇微雨》"
  },
  {
    "poetry": "我居北海君南海，寄雁傳書謝不能。 <br>桃李春風一杯酒，江湖夜雨十年燈。",
    "author": "宋·黃庭堅《寄黃幾复》"
  },
  {
    "poetry": "數間茅舍，藏書萬卷，投老村家。 <br>山中何事？松花釀酒，春水煎茶。",
    "author": "元·張可久《人月圓·山中書事》"
  },
  {
    "poetry": "窗間梅熟落蒂，牆下筍成出林。 <br>連雨不知春去，一晴方覺夏深。",
    "author": "宋·范成大《喜晴》"
  },
  {
    "poetry": "折梅逢驛使，寄與隴頭人。 <br>江南無所有，聊贈一枝春。",
    "author": "南北朝·陸凱《贈范曄》"
  },
  {
    "poetry": "蘇溪亭上草漫漫，誰倚東風十二闌。 <br>燕子不歸春事晚，一汀煙雨杏花寒。",
    "author": "唐·戴叔倫《江南曲》"
  },
  {
    "poetry": "人閒桂花落，夜靜春山空。 <br>月出驚山鳥，時鳴春澗中。",
    "author": "唐·王維《鳥鳴澗》"
  },
  {
    "poetry": "楊柳絲絲弄輕柔，煙縷織成愁。 <br>海棠未雨，梨花先雪，一半春休。",
    "author": "清·王雱《眼兒媚》"
  },
  {
    "poetry": "紅葉醉秋色，碧溪彈夜弦。 <br>佳期不可再，風雨杳如年。",
    "author": "唐·湘驛女子《題玉泉溪》"
  },
  {
    "poetry": "雨橫風狂三月暮，門掩黃昏，無計留春住。 <br>淚眼問花花不語，亂紅飛過鞦韆去。",
    "author": "唐·歐陽修《蝶戀花》"
  },
  {
    "poetry": "水是眼波橫，山是眉峰聚。 <br>欲問行人去那邊？眉眼盈盈處。",
    "author": "宋·王觀《卜算子》"
  },
  {
    "poetry": "霧失樓台，月迷津渡。桃源望斷無尋處。 <br>可堪孤館閉春寒，杜鵑聲裡斜陽暮。",
    "author": "宋·秦觀《踏莎行》"
  },
  {
    "poetry": "空山新雨後，天氣晚來秋。 <br>明月松間照，清泉石上流。",
    "author": "唐·王維《山居秋暝》"
  },
  {
    "poetry": "二十四橋仍在，波心蕩、冷月無聲。 <br>念橋邊紅藥，年年知為誰生！",
    "author": "宋·姜夔《揚州慢》"
  },
  {
    "poetry": "綠蟻新醅酒，紅泥小火爐。 <br>晚來天欲雪，能飲一杯無？",
    "author": "唐·白居易《問劉十九》"
  },
  {
    "poetry": "幾回花下坐吹簫，銀漢紅牆入望遙。 <br>似此星辰非昨夜，為誰風露立中宵。",
    "author": "清·黃景仁《綺懷》"
  },
  {
    "poetry": "江碧鳥逾白，山青花欲燃。 <br>今春看又過，何日是歸年。",
    "author": "唐·杜甫《絕句》"
  },
  {
    "poetry": "黃梅時節家家雨，青草池塘處處蛙。 <br>有約不來過夜半，閒敲棋子落燈花。",
    "author": "宋·趙師秀《約客》"
  },
  {
    "poetry": "勞歌一曲解行舟，紅葉青山水急流。 <br>日暮酒醒人已遠，滿天風雨下西樓。",
    "author": "唐·許渾《謝亭送別》"
  },
  {
    "poetry": "故人今在否？舊江山渾是新愁。 <br>欲買桂花同載酒，終不似，少年遊。",
    "author": "宋·劉過《唐多令》"
  },
  {
    "poetry": "問余何意棲碧山，笑而不答心自閒。 <br>桃花流水窅然去，別有天地非人間。",
    "author": "唐·李白《山中問答》"
  },
  {
    "poetry": "海水夢悠悠，君愁我亦愁。<br>南風知我意，吹夢到西洲。",
    "author": "南北朝·佚名《西洲曲》"
  },
  {
    "poetry": "新年都未有芳華，二月初驚見草芽。<br>白雪卻嫌春色晚，故穿庭樹作飛花。",
    "author": "唐·韓愈《春雪》"
  },
  {
    "poetry": "昔我往矣，楊柳依依。<br>今我來思，雨雪霏霏。",
    "author": "詩經·小雅《采薇》"
  },
  {
    "poetry": "故人何不返，春華複應晚。<br>不道新知樂，只言行路遠。",
    "author": "南北朝·柳惲《江南曲》"
  },
  {
    "poetry": "春風倚棹闔閭城，水國春寒陰複晴。<br>細雨濕衣看不見，閑花落地聽無聲。",
    "author": "唐·劉長卿《別嚴士元》"
  },
  {
    "poetry": "竹搖清影罩幽窗，兩兩時禽噪夕陽。<br>謝卻海棠飛盡絮，困人天氣日初長。",
    "author": "宋·朱淑真《即景》"
  },
  {
    "poetry": "穀口春殘黃鳥稀，辛夷花盡杏花飛。<br>始憐幽竹山窗下，不改清陰待我歸。",
    "author": "唐·錢起《晚春歸山居題窗前竹》"
  },
  {
    "poetry": "獨敲初夜磬，閑倚一枝藤。<br>世界微塵裏，吾寧愛與憎。",
    "author": "唐·李商隱《北青蘿》"
  },
  {
    "poetry": "雲想衣裳花想容，春風拂檻露華濃。<br>若非群玉山頭見，會向瑤台月下逢。",
    "author": "唐·李白《清平調》"
  },
  {
    "poetry": "貴逼人來不自由，龍驤鳳翥勢難收。<br>滿堂花醉三千客，一劍霜寒十四州。",
    "author": "唐·貫休《獻錢尚父》"
  },
  {
    "poetry": "惶恐灘頭說惶恐，零丁洋裏歎零丁。<br>人生自古誰無死，留取丹心照汗青。",
    "author": "宋·文天祥《過零丁洋》"
  }
];
